"""
# File       : stock_config.py
# Time       ：2022/5/9 2:27 PM
# Author     ：A_zz
# email      ：chenzhe12320@163.com
# Description：
"""
conf = {
    'cn': {
        'st': {
            'code': '600000',
            'counter_id': 'ST/SH/600000',
            'rpc': '盘口详情',
            'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                          '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
                          '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手'],
            'close_case': ['最高', '今开', '换手率', '市盈率ttm', '最低', '昨收', '成交额', '总市值'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        'ix': {
            'code': 'SH|000001',
            'counter_id': 'IX/SH/000001',
            'rpc': '盘口详情',
            'open_case': ['今开', '最高', '最低', '昨收', '成交量', '成交额', '上涨', '下跌', '平盘', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        'bk-lb': {
            'code': 'LB40064',
            'counter_id': 'BK/SH/LB40064',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
    },
    'hk': {
        'st': {'code': '00700',
               'counter_id': 'ST/HK/700',
               'name': '腾讯控股1',
               'rpc': '盘口详情',
               'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                             '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
                             '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手'],
               'close_case': ['最高', '今开', '换手率', '市盈率ttm', '最低', '昨收', '成交额', '总市值'],
               "last_done": ["最新价", "涨跌幅", "涨跌额"],
               },
        'etf': {'code': '07552',
                'counter_id': 'ETF/HK/7552',
                'name':'XI二南方恒科',
                'rpc': '盘口详情',
                'open_case': ['最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                              '52周低', '量比', '股息率ttm', '股息ttm', '总股本', '资产规模', '每手'],
                'close_case': ['最高', '今开', '成交额', '最低', '资产规模', '昨收', '成交量', '换手率'],
                "last_done": ["最新价", "涨跌幅", "涨跌额"],
                },
        # 大盘指数
        'ix': {
            'code': 'HSI',
            'counter_id': 'IX/HK/HSI',
            'rpc': '盘口详情',
            'open_case': ['今开', '最高', '最低', '昨收', '成交量', '成交额', '上涨', '下跌', '平盘', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 行业
        'bk-lb': {
            'code': 'LB20168',
            'counter_id': 'BK/HK/LB20160',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 概念
        'bk-cp': {
            'code': 'CP20002',
            'counter_id': 'BK/HK/CP20002',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 窝轮 sub put
        # 认购证
        'sub': {
            'code': '14429',
            'counter_id': 'WT/HK/14429',
            'name': '腾讯麦银四一购A',
            'rpc': '轮证详情',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '街货量', '成交额', '街货比', '溢价', '引申波幅',
                          '价内/价外', '打和点', '行权价', '到期日', '换股价', '最后交易日', '换股比率', '每手股数'],  # '有效杠杆', '对冲值', '杠杆比率'
            'close_case': ['最高', '今开', '成交额', '引申波幅', '最低', '昨收', '成交量'],  # '有效杠杆'
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 认沽证
        'put': {
            'code': '29814',
            'counter_id': 'WT/HK/29814',
            'rpc': '轮证详情',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '街货量', '成交额', '街货比', '溢价', '引申波幅',
                          '价内/价外', '打和点', '行权价', '到期日', '换股价', '最后交易日', '换股比率', '每手股数'],  # '有效杠杆', '对冲值', '杠杆比率'
            'close_case': ['最高', '今开', '成交额', '引申波幅', '最低', '昨收', '成交量'],  # '有效杠杆'
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # region 新股
        #     # 新股暗盘 跟个股一样
        #     'st-dark': {
        #         'code': '02390',
        #         'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
        #                         '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
        #                         '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手']
        #     },
        #     # 新股首日 跟个股一样
        #     'st-first': {
        #         'code': '02390',
        #         'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
        #                         '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
        #                         '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手']
        #     },
        # endregion
        # 牛熊证 bull bear
        'bull': {
            'code': '59288',
            'counter_id': 'WT/HK/59288',
            'rpc': '轮证详情',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '街货量', '成交额', '街货比', '溢价', '价内/价外', '距收回价',
                          '打和点', '行权价', '收回价', '换股价', '到期日', '换股比率', '最后交易日', '每手股数'],  # '杠杆比率',
            "close_case": ['最高', '今开', '成交额', '溢价', '最低', '昨收', '成交量', '距收回价'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        'bear': {
            'code': '52268',
            'counter_id': 'WT/HK/52268',
            'rpc': '轮证详情',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '街货量', '成交额', '街货比', '溢价', '价内/价外', '距收回价',
                          '打和点', '行权价', '收回价', '换股价', '到期日', '换股比率', '最后交易日', '每手股数'],  # '杠杆比率',
            "close_case": ['最高', '今开', '成交额', '溢价', '最低', '昨收', '成交量', '距收回价'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 界内证 inline
        'inline': {
            'code': '47760',
            'counter_id': 'WT/HK/47760',
            'rpc': '轮证详情',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '街货量', '成交额', '街货比', '溢价', '上限价', '界内/界外',
                          '下限价', '到期日', '每手股数', '最后交易日'],  # '杠杆比率',
            'close_case': ['最高', '今开', '成交额', '溢价', '最低', '昨收', '成交量', '界内/界外'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        }
    },
    'us': {
        'st': {'code': 'BABA',
               'counter_id': 'ST/US/BABA',
               'name': '阿里巴巴',
               'rpc': '盘口详情',
               'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                             '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
                             '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手'],
               'close_case': ['最高', '今开', '换手率', '市盈率ttm', '最低', '昨收', '成交额', '总市值'],
               "last_done": ["最新价", "涨跌幅", "涨跌额"],
               },
        'otc': {'code': 'TCEHY',
                'counter_id': 'ST/US/TCEHY',
                'rpc': '盘口详情',
                'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                              '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
                              '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手'],
                'close_case': ['最高', '今开', '换手率', '市盈率ttm', '最低', '昨收', '成交额', '总市值'],
                "last_done": ["最新价", "涨跌幅", "涨跌额"],
                },
        'etf': {'code': 'SQQQ',
                'counter_id': 'ETF/US/SQQQ',
                'rpc': '盘口详情',
                'open_case': ['最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                              '52周低', '量比', '股息率ttm', '股息ttm', '总股本', '资产规模', '每手'],
                'close_case': ['最高', '今开', '成交额', '最低', '资产规模', '昨收', '成交量', '换手率'],
                "last_done": ["最新价", "涨跌幅", "涨跌额"],
                },
        # 大盘指数
        'ix': {
            'code': '.DJI',
            'counter_id': 'IX/US/.DJI',
            'rpc': '盘口详情',
            'open_case': ['今开', '最高', '最低', '昨收', '成交量', '成交额', '上涨', '下跌', '平盘', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 行业
        'bk-lb': {
            'code': 'LB00140',
            'counter_id': 'BK/US/LB00140',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 概念
        'bk-cp': {
            'code': 'CP00005',
            'counter_id': 'BK/US/CP00005',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        }
    },
    'sg': {
        'st': {
            'code': 'D05',
            'counter_id': 'ST/SG/D05',
            'rpc': '盘口详情',
            'open_case': ['行情货币', '最高', '今开', '最低', '昨收', '均价', '成交量', '换手率', '成交额', '振幅', '52周高', '委比',
                          '52周低', '量比', '市盈率ttm', '每股收益ttm', '市盈率动', '每股收益动', '市盈率静', '每股收益静', '市净率', '每股净资产',
                          '股息率ttm', '总股本', '总市值', '流通股本', '流通市值', '每手'],
            'close_case': ['最高', '今开', '换手率', '市盈率ttm', '最低', '昨收', '成交额', '总市值'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        'ix': {
            'code': 'STI',
            'counter_id': 'IX/SG/STI',
            'rpc': '盘口详情',
            'open_case': ['今开', '最高', '最低', '昨收', '成交量', '成交额', '上涨', '下跌', '平盘', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        'bk-lb': {
            'code': 'LB30168',
            'counter_id': 'BK/SG/LB30168',
            'rpc': '盘口详情',
            'open_case': ['最高', '今开', '最低', '昨收', '上涨', '下跌', '平盘', '成交量', '成交额', '总市值', '振幅', '52周高', '52周低'],
            'close_case': ['最高', '今开', '成交额', '总市值', '最低', '昨收', '成交量', '振幅'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
    },
}

op_conf = {
    'us': {
        # 期权看涨
        'op-call': {
            'code': 'AAPL',
            'counter_id': 'ST/US/AAPL',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '未平仓数', '成交额', '行权价', '到期日',
                          '合约乘数', '距到期日', '合约规模'],  # '溢价', '隐含波动率', 'delta', '历史波动率', 'vega', 'gamma', 'rho', 'theta',
            'close_case': ['最高', '今开', '成交额', '最低', '昨收', '成交量', '未平仓数'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        },
        # 期权看跌
        'op-put': {
            'code': 'AAPL',
            'counter_id': 'ST/US/AAPL',
            'open_case': ['最高', '今开', '最低', '昨收', '成交量', '未平仓数', '成交额', '行权价', '到期日',
                          '合约乘数', '距到期日', '合约规模'],  # '溢价', '隐含波动率', 'delta', '历史波动率', 'vega', 'gamma', 'rho', 'theta',
            'close_case': ['最高', '今开', '成交额', '最低', '昨收', '成交量', '未平仓数'],
            "last_done": ["最新价", "涨跌幅", "涨跌额"],
        }
    }
}
